# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMTkxZTU1Ni0wODc4LTQzYzAtOTNiNS0xMjhhNWJmMWQ2OTk7b2JqZWN0SWQ9NjlhM2I0ZjgtYTExOS00NzM0LTk2NTgtZmNiZjdjNjM4M2U2O3N1YnNjcmlwdGlvbklkPTBmMDVlOWQ0LTU5MmItNDkxYS1iOWRhLTQ5YThiMjQyZDBjNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_key_vault_secret.admin_conn_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "admin_conn_string" {
        id                      = "https://oed-prod-kv.vault.azure.net/secrets/dd-pgadmin-connection-string/a6fa92717e484e9aa8540c6fbcb5d160"
        name                    = "dd-pgadmin-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.user_conn_string will be created
  + resource "azurerm_key_vault_secret" "user_conn_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.KeyVault/vaults/oed-prod-kv"
      + name                    = "OedConfig--Postgres--ConnectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_flexible_server.pg will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pg" {
        id                                = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
        name                              = "dd-prod-pg"
      ~ tags                              = {
          + "costcenter" = "altinn3"
          + "solution"   = "apps"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_postgresql_flexible_server_database.db will be destroyed
  # (because azurerm_postgresql_flexible_server_database.db is not in configuration)
  - resource "azurerm_postgresql_flexible_server_database" "db" {
      - charset   = "UTF8" -> null
      - collation = "en_US.utf8" -> null
      - id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg/databases/dd-prod-pg-db" -> null
      - name      = "dd-prod-pg-db" -> null
      - server_id = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg" -> null
    }

  # azurerm_postgresql_flexible_server_database.oed_db will be created
  + resource "azurerm_postgresql_flexible_server_database" "oed_db" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "dd-oed-prod-pg-db"
      + server_id = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["Oekern_office"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "78.41.45.0"
      + id               = (known after apply)
      + name             = "Oekern_office"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "78.41.45.0"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["aks"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.5.59"
      + id               = (known after apply)
      + name             = "aks"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.251.5.58"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["authz-20-100-129-217"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.129.217"
      + id               = (known after apply)
      + name             = "authz-20-100-129-217"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.129.217"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["authz-20-100-130-140"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.130.140"
      + id               = (known after apply)
      + name             = "authz-20-100-130-140"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.130.140"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["authz-20-100-130-142"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.130.142"
      + id               = (known after apply)
      + name             = "authz-20-100-130-142"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.130.142"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["authz-20-100-130-168"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.130.168"
      + id               = (known after apply)
      + name             = "authz-20-100-130-168"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.130.168"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["authz-20-100-131-64"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.131.64"
      + id               = (known after apply)
      + name             = "authz-20-100-131-64"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.131.64"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["authz-20-100-3-3"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.3.3"
      + id               = (known after apply)
      + name             = "authz-20-100-3-3"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.3.3"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["authz-20-100-33-251"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.100.33.251"
      + id               = (known after apply)
      + name             = "authz-20-100-33-251"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.100.33.251"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.whitelist["feedpoller-20-251-75-137"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "whitelist" {
      + end_ip_address   = "20.251.75.137"
      + id               = (known after apply)
      + name             = "feedpoller-20-251-75-137"
      + server_id        = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/dd-prod-pg"
      + start_ip_address = "20.251.75.137"
    }

  # azurerm_windows_function_app.feedpoller will be updated in-place
  ~ resource "azurerm_windows_function_app" "feedpoller" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/0f05e9d4-592b-491a-b9da-49a8b242d0c5/resourceGroups/altinn-digdir-oed-rg/providers/Microsoft.Web/sites/oed-feedpoller-func"
        name                                           = "oed-feedpoller-func"
        tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "solution"                                       = "apps"
        }
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 12 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `push` |
| Working Directory | `./infra/altinn-digdir-oed-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/prod/altinn-digdir-oed-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_prod_altinn-digdir-oed-rg.tfstate.tfplan`